Revit 2024 API
Hardwood.HardwoodImperfections Property
 The property labeled "Relief Pattern" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string HardwoodImperfections { get; }
Visual Basic
Public Shared ReadOnly Property HardwoodImperfections As String
	Get
Visual C++
public:
static property String^ HardwoodImperfections {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodImperfectionsType".
See Also
Hardwood Class
Autodesk.Revit.DB.Visual Namespace